# DirectShapeReferenceOptions Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
DirectShapeReferenceOptions Members
DirectShapeReferenceOptions Class Constructors Methods Properties See Also
---
The DirectShapeReferenceOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DirectShapeReferenceOptions()()()() | Constructs a new DirectShapeRefOptions instance with default settings. |
| DirectShapeReferenceOptions(DirectShapeReferenceOptions) | Constructs a new copy of the input DirectShapeRefOptions object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the DirectShapeReferenceOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsValidReferenceName | Validates that the input name can be assigned to a direct shape reference. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | The name associated with the reference object. The name does not need to be unique. The name must not be empty and must contain valid characters. |

# See Also
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace